CFD/WindTunnel_CFD_rotorDisk/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solver          simpleFoam;

// startFrom       latestTime; /* Set to latestTime if we want to pause and resume*/

startTime       0;

stopAt          endTime;

endTime         200; /* Run for n seconds */

deltaT          1;

// adjustTimeStep  true;

// maxCo           0.5;

writeControl    adjustableRunTime;

writeInterval   1; /* Write every n seconds */

purgeWrite      1000; /* For IBF it's about 250mb per file, so cap at 50gb stored*/

writeFormat     binary; /* Use binary to conserve storage*/

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true; /* This allows for modification in the middle of a run */

functions
{
  #include "functions/velocityUniformity.cfg"
  #include "functions/turbulenceIntensity.cfg"
}

// ************************************************************************* //
