CFD/WindTunnel_CFD_rotorDisk/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    (0 -0.5 -.8)
    (6.5 -0.5 -.8)
    (6.5  1.5 -.8)
    (0  1.5 -.8)
    (0 -0.5 1.3)
    (6.5 -0.5 1.3)
    (6.5  1.5 1.3)
    (0  1.5 1.3)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (65 20 21) simpleGrading (1 1 1)
);

boundary
(
    tempWalls
    {
        type patch;
        faces
        (
            (1 5 6 2) // front
            (3 2 6 7) // back
            (0 4 5 1) // inlet
            (0 3 7 4) // outlet
            (4 7 6 5) // lower
            (0 1 2 3) // upper
        );
    }
    // tempWalls
    // {
    //     type patch;
    //     faces
    //     (
    //         (1 5 6 2)
    //     );
    // }
    // backWall
    // {
    //     type patch;
    //     faces
    //     (
    //         (3 2 6 7)
    //     );
    // }
    // inlet
    // {
    //     type patch;
    //     faces
    //     (
    //         (0 4 5 1)
    //     );
    // }
    // outlet
    // {
    //     type patch;
    //     faces
    //     (
    //         (0 3 7 4)
    //     );
    // }
    // lowerWall
    // {
    //     type patch;
    //     faces
    //     (
    //         (4 7 6 5)
    //     );
    // }
    // upperWall
    // {
    //     type patch;
    //     faces
    //     (
    //         (0 1 2 3)
    //     );
    // }
);

// ************************************************************************* //
