CFD/WindTunnel_CFD_rotorDisk/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// solvers
// {
//     p
//     {
//         solver          GAMG;
//         tolerance       1e-07;
//         relTol          0.01;
//         smoother        GaussSeidel;
//     }

//     pFinal
//     {
//         $p;
//         tolerance       5e-07;
//         relTol          0;
//     }

//     Phi
//     {
//         $p;
//     }

//     "(U|k|omega)"
//     {
//         solver smoothSolver;
//         smoother GaussSeidel;
//         tolerance       1e-07;
//         relTol          0.1;
//         limit           1.0;
//     }
    
// }

// SIMPLE
// {
//     nNonOrthogonalCorrectors 1;
//     pRefCell       0;
//     pRefValue      0;
// }

// relaxationFactors
// {
//     fields
//     {
//         p               0.2;
//     }

//     equations
//     {
//         U               0.5;
//         k               0.1;
//         omega           0.1;
//     }
// }

// cache
// {
//     grad(U);
// }


solvers
{
    p
    {
        solver          GAMG; // Fast multi-grid solver for pressure
        tolerance       1e-7;
        relTol          0.01;
        smoother        GaussSeidel;
    }

    "(U|k|omega|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 2; // Increase to 1 or 2 if your mesh quality is poor
    consistent      yes;        // Uses SIMPLEC, which converges faster
}

relaxationFactors
{
    equations
    {
        U               0.5; // Higher values converge faster but are less stable
        k               0.3;
        omega           0.3;
    }
}

// ************************************************************************* //