CFD/WindTunnel_CFD_rotorDisk/system/functions/turbulenceIntensity.cfg
// Turbulence Intensity Calculation on a Cutting Plane
// Results will be stored in postProcessing/turbulenceIntensity/

turbulenceIntensity
{
    type            surfaceFieldValue;
    libs            (fieldFunctionObjects);
    writeControl    writeTime;
    log             true;
    writeFields     false;
    
    // Operation: areaAverage provides the mean value across the plane
    operation       areaAverage; 
    regionType      sampledSurface; 
    name           turbulenceIntensityName;

    sampledSurfaceDict
    {
        type            cuttingPlane;
        planeType       pointAndNormal;
        pointAndNormalDict
        {
            basePoint       (2.25 0.5 0.3); 
            normalVector    (1 0 0); 
        }
        interpolate     true;
    }

    // We need both U and k to manually verify or post-process intensity
    // Ensure your turbulence model is active so 'k' exists
    fields          ( U k );
}