CFD/WindTunnel_CFD_rotorDisk/system/functions/velocityUniformity.cfg
velocityUniformity
{
    type            surfaceFieldValue;
    libs            (fieldFunctionObjects);
    writeControl    writeTime;
    log             true;
    writeFields     false;

    operation       uniformity; 
    regionType      sampledSurface; 

    name            testSectionPlane;
    
    sampledSurfaceDict
    {
        type            cuttingPlane;
        planeType       pointAndNormal;
        pointAndNormalDict
        {
            point       (2.25 0.5 0.3); 
            normal    (1 0 0); 
        }
        interpolate     true;
    }

    fields          ( U );
}

meanVelocity
{
    type            surfaceFieldValue;
    libs            (fieldFunctionObjects);
    writeControl    writeTime;
    log             true;
    writeFields     false; 

    operation       areaAverage; 
    regionType      sampledSurface;
    name            velocityUniformity; 

    sampledSurfaceDict
    {
        type            cuttingPlane;
        planeType       pointAndNormal;
        pointAndNormalDict
        {
            point       (2.25 0.5 0.3); 
            normal    (1 0 0); 
        }
        interpolate     true;
    }

    fields          ( U );
}