CFD/WindTunnel_CFD_rotorDisk/system/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

disk
{
    type            rotorDiskSource;
    selectionMode   cellZone;
    cellZone        fanCellZone;
    
    // Physical Parameters
    nBlades         3;
    
    // Origin is your fan center; Axis (1 0 0) + Positive Omega 
    // results in a Right-Hand Rule rotation that pulls air toward +X
    origin          (2 .61695197 .26437480);
    axis            (1 0 0);
    
    // 1800 RPM
    omega           constant 188.5; 

    geometryMode    specified;
    radiusData
    (
        // radius   chord   twist (deg)
        (0.1        0.08    25)
        (0.25       0.07    18) // Added mid-span point for better interpolation
        (0.4        0.05    12)
        (0.5        0.04    8)
    );

    trimModel       none;
    
    leaf
    {
        type            lookup;
        data
        (
            // (AoA_deg  Cl      Cd)
            (-20        -0.6    0.2)  // Post-stall negative
            (-10        -0.4    0.05)
            (0           0.3    0.02) // Cambered: produces lift at 0 AoA
            (10          1.1    0.06)
            (15          1.4    0.12) // Peak Lift
            (20          1.0    0.25) // Stall: Lift drops, Drag spikes
            (30          0.7    0.45) // Deep Stall
        );
    }
}

// ************************************************************************* //
